In [1]:
import pandas as pd

In [8]:
temperatures = pd.DataFrame({'Max':[98.5, 97, 101], 'James':[98, 102, 99], 'Emma':[98,97,104]})

In [9]:
temperatures

     Max  James  Emma
0   98.5     98    98
1   97.0    102    97
2  101.0     99   104

In [16]:
temperatures.index = ['Morning', 'Afternoon', 'Evening']

In [17]:
temperatures

             Max  James  Emma
Morning     98.5     98    98
Afternoon   97.0    102    97
Evening    101.0     99   104

In [19]:
temperatures['Max']

Morning       98.5
Afternoon     97.0
Evening      101.0
Name: Max, dtype: float64

In [32]:
temperatures.iloc[0]

          Max  James  Emma
Morning  98.5     98    98

In [34]:
temperatures.loc[['Morning', 'Evening']]

           Max  James  Emma
Morning   98.5     98    98
Evening  101.0     99   104

In [35]:
temperatures

             Max  James  Emma
Morning     98.5     98    98
Afternoon   97.0    102    97
Evening    101.0     99   104

In [39]:
temperatures[['Emma','Max']]

           Emma    Max
Morning      98   98.5
Afternoon    97   97.0
Evening     104  101.0

In [40]:
temperatures.describe()

              Max       James        Emma
count    3.000000    3.000000    3.000000
mean    98.833333   99.666667   99.666667
std      2.020726    2.081666    3.785939
min     97.000000   98.000000   97.000000
25%     97.750000   98.500000   97.500000
50%     98.500000   99.000000   98.000000
75%     99.750000  100.500000  101.000000
max    101.000000  102.000000  104.000000

In [41]:
sorted_temperatures = temperatures.reindex(sorted(temperatures.columns), axis=1)

In [42]:
sorted_temperatures

           Emma  James    Max
Morning      98     98   98.5
Afternoon    97    102   97.0
Evening     104     99  101.0